Repository: Alaaeddine-chakroun/windowsperf-vs-extension
Catalog: WindowsPerfGUI/Resources/Locals/ErrorLanguagePack.*.resx
Languages: fr_fr

# NotInititiatedWperfErrorLine1
source: WidnowsPerf is not initialized please follow the initialization steps
fr_fr: WindowsPerf n'est pas initialisé, veuillez suivre les étapes d'initialisation suivantes

# NotInititiatedWperfErrorLine2
source: To do so go to Tools -> Options -> WindowsPerf -> Wperf Path
fr_fr: Pour ce faire, allez dans Outils -> Options -> WindowsPerf -> Chemin de WindowsPerf

# IncompleteSamplingSettingsLine1
source: To start sampling you need to have at least the executable file path and the event name as well as the core selected!
fr_fr: Pour commencer l'échantillonnage, vous devez avoir au moins le chemin du fichier exécutable et le nom de l'événement ainsi que le core sélectionné !

# RunningSamplingOverlapLine1
source: WindowsPerf is currently sampling
fr_fr: Un échantillonnage est actuellement en cours

# RunningSamplingOverlapLine2
source: Please wait for the current sampling to finish before starting another sampling instance
fr_fr: Veuillez attendre la fin de l'échantillonnage en cours avant de redémarrer une autre instance

# ErrorWindowsPerfCLI
source: WindowsPerf Error
fr_fr: Erreur de WindowsPerf

# NoWindowsPerfCliData
source: No results were returned from WindowsPerf
fr_fr: Aucun résultat n'a été renvoyé par WindowsPerf

# WperfUnavailable
source: WindowsPerf is not available at the indicated path or not initialized
fr_fr: WindowsPerf n'est pas disponible sur le chemin indiqué ou n'est pas initialisé

# RawEventBadFormat
source: Badly formatted raw event. Please specify raw events with r<VALUE> where <VALUE> is a 16-bit hexadecimal event index value without leading 0x. For example r10 is event with index 0x10
fr_fr: Événement brut mal formaté. Veuillez spécifier les événements explicites avec r<VALEUR> où <VALEUR> est une valeur d'index d'événement hexadécimal de 16 bits sans 0x en tête. Par exemple, r10 est un événement avec l'index 0x10

# RawEventExists
source: Raw event already exists. Please enter a different event.
fr_fr: L'événement brut existe déjà. Veuillez entrer un événement différent.

# MinimumVersionMismatch
source: This version of the extention was built to only support WindowsPerf version {0}!
fr_fr: Cette version de l'extension a été conçue pour fonctionner uniquement avec la version WindowsPerf {0}!

# MinimumVersionMismatchLine2
source: In order to bypass this check, please go to Tools -> Options -> WindowsPerf -> WindowsPerf Path and check the 'Ignore WindowsPerf version check' checkbox.
fr_fr: Afin de contourner cette vérification, veuillez consulter les outils -> Options -> WindowsPerf -> Path Windowsperf et cochez la case «Ignorer Windowsperf Version Check».

# WperfPathChanged
source: Error starting wperf process. Please double check your wperf path.
fr_fr: Erreur Démarrage du processus WindowsPerf. Veuillez vérifier votre chemin WindowsPerf.

# IncompleteCountingSettingsLine1
source: To start counting you need to have at least an event or a metric selected, as well as at least one core selected!
fr_fr: Pour commencer le comptage, vous devez avoir au moins un événement ou une métrique ainsi que au moins un core sélectionné !

# RunningCountingOverlapLine1
source: WindowsPerf is currently counting
fr_fr: Un comptage est actuellement en cours

# RunningCountingOverlapLine2
source: Please wait for the current counting to finish before starting another counting instance
fr_fr: Veuillez attendre la fin du comptage en cours avant de redémarrer une autre instance

# WPANotInstalled
source: WPA is not installed. Please make sure it's installed correctly and added to the PATH environment variable.
fr_fr: WPA n'est pas installé. Veuillez vous assurer qu'il est correctement installé et ajouté à la variable d'environnement PATH.

# WPAPluginNotInstalled
source: Could not detect WindowsPerf WPA Plugin. Please make sure the plugin is installed correctly.
fr_fr: Impossible de détecter le plug-in WindowsPerf WPA. Veuillez vous assurer que le plugin est correctement installé.
